reproducibilityPackages/convergence/openfoam/iterativeIndependence/tol1.0E-06/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  surfaceFeatureExtractDict;
}

//****************************************************************************//

boxNear.obj
{
  extractionMethod extractFromSurface;

  extractFromSurfaceCoeffs
  {
    includedAngle 180;
  }

  writeObj yes;
}

boxWake.obj
{
  extractionMethod extractFromSurface;

  extractFromSurfaceCoeffs
  {
    includedAngle 180;
  }

  writeObj yes;
}

//****************************************************************************//
